## Deployment failed for PR-2! :x:

### Errors:

```json

error provisioning resource mysql#modules.node-workload.externals.db GuResID: a0a0c0036ffd8a07f1d0022e5cf18de11f9279d4. Status: False. Reason: DriverFailed. Message: unexpected response code (400) and error provisioning the resource: RES-004: creating RDS DB Instance (hum-rp-mysql-example): operation error RDS: CreateDBInstance, https response error StatusCode: 400, RequestID: bacad943-3231-4255-b0e4-bb5c38b2e280, DBInstanceAlreadyExists: DB instance already exists: 

---

Downloading scripts / inputs / files from storage ...
Preparing a new workspace at '/home/runneruser/workspace/src'...
Fetching script files from 'https://github.com/humanitec-architecture/resource-packs-aws.git/modules/rds/basic' (refs/heads/main)...
Applying local scripts and overrides from '/home/runneruser/workspace/script'...
Checking for previous terraform resource state files...
Executing terraform init...
{
  "terraform_version": "1.5.7",
  "platform": "linux_amd64",
  "provider_selections": {},
  "terraform_outdated": true
}

Initializing the backend...
Initializing modules...
Downloading registry.terraform.io/terraform-aws-modules/rds/aws 6.3.0 for db...
- db in .terraform/modules/db
- db.db_instance in .terraform/modules/db/modules/db_instance
- db.db_instance_role_association in .terraform/modules/db/modules/db_instance_role_association
- db.db_option_group in .terraform/modules/db/modules/db_option_group
- db.db_parameter_group in .terraform/modules/db/modules/db_parameter_group
- db.db_subnet_group in .terraform/modules/db/modules/db_subnet_group

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0, >= 5.25.0"...
- Finding hashicorp/random versions matching ">= 3.1.0"...
- Installing hashicorp/aws v5.72.1...
- Installed hashicorp/aws v5.72.1 (signed by HashiCorp)
- Installing hashicorp/random v3.6.3...
- Installed hashicorp/random v3.6.3 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!
Executing terraform apply...
module.db.module.db_instance.data.aws_partition.current: Reading...
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=hum-rp-mysql-example-20241017205446204300000002]
module.db.module.db_subnet_group.aws_db_subnet_group.this[0]: Refreshing state... [id=hum-rp-mysql-ex-node11-pr-2-modules-node-workload-externals-db-20241017205446203500000001]
module.db.module.db_option_group.aws_db_option_group.this[0]: Refreshing state... [id=hum-rp-mysql-example-20241017205446204900000003]
module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=rds-basic-monitoring-role-20241017205446205500000004]
module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=rds-basic-monitoring-role-20241017205446205500000004-20241017205447182000000005]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.db.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 1
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "my_database"
      + db_subnet_group_name                  = "hum-rp-mysql-ex-node11-pr-2-modules-node-workload-externals-db-20241017205446203500000001"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "8.0"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = false
      + id                                    = (known after apply)
      + identifier                            = "hum-rp-mysql-example"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t4g.large"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 100
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = "arn:aws:iam::339712895890:role/rds-basic-monitoring-role-20241017205446205500000004"
      + multi_az                              = true
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = "hum-rp-mysql-example-20241017205446204900000003"
      + parameter_group_name                  = "hum-rp-mysql-example-20241017205446204300000002"
      + password                              = (sensitive value)
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = 7
      + port                                  = 3306
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = {
          + "hum:app"    = "node11"
          + "hum:env"    = "pr-2"
          + "hum:res"    = "modules.node-workload.externals.db"
          + "humanitec"  = "true"
          + "managed_by" = "terraform"
        }
      + timezone                              = (known after apply)
      + username                              = (sensitive value)
      + vpc_security_group_ids                = [
          + "sg-0cb0afd368a823caf",
        ]

      + timeouts {}
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + host     = (known after apply)
module.db.module.db_instance.aws_db_instance.this[0]: Creating...

Error: creating RDS DB Instance (hum-rp-mysql-example): operation error RDS: CreateDBInstance, https response error StatusCode: 400, RequestID: bacad943-3231-4255-b0e4-bb5c38b2e280, DBInstanceAlreadyExists: DB instance already exists

  with module.db.module.db_instance.aws_db_instance.this[0],
  on .terraform/modules/db/modules/db_instance/main.tf line 29, in resource "aws_db_instance" "this":
  29: resource "aws_db_instance" "this" {



```

<details><summary>Errors details</summary>

### Errors details:
```json

[
  {
    "apiVersion": "entity.humanitec.io/v1b1",
    "entity": {},
    "kind": "DeploymentError",
    "metadata": {
      "app_id": "node11",
      "deploy_id": "17ff58d2450085ec",
      "env_id": "pr-2",
      "org_id": "htc-demo-41"
    },
    "status": {
      "code": "OPR-001",
      "error_type": "",
      "message": "error provisioning resource mysql#modules.node-workload.externals.db GuResID: a0a0c0036ffd8a07f1d0022e5cf18de11f9279d4. Status: False. Reason: DriverFailed. Message: unexpected response code (400) and error provisioning the resource: RES-004: creating RDS DB Instance (hum-rp-mysql-example): operation error RDS: CreateDBInstance, https response error StatusCode: 400, RequestID: bacad943-3231-4255-b0e4-bb5c38b2e280, DBInstanceAlreadyExists: DB instance already exists: \n\n---\n\nDownloading scripts / inputs / files from storage ...\nPreparing a new workspace at '/home/runneruser/workspace/src'...\nFetching script files from 'https://github.com/humanitec-architecture/resource-packs-aws.git/modules/rds/basic' (refs/heads/main)...\nApplying local scripts and overrides from '/home/runneruser/workspace/script'...\nChecking for previous terraform resource state files...\nExecuting terraform init...\n{\n  \"terraform_version\": \"1.5.7\",\n  \"platform\": \"linux_amd64\",\n  \"provider_selections\": {},\n  \"terraform_outdated\": true\n}\n\nInitializing the backend...\nInitializing modules...\nDownloading registry.terraform.io/terraform-aws-modules/rds/aws 6.3.0 for db...\n- db in .terraform/modules/db\n- db.db_instance in .terraform/modules/db/modules/db_instance\n- db.db_instance_role_association in .terraform/modules/db/modules/db_instance_role_association\n- db.db_option_group in .terraform/modules/db/modules/db_option_group\n- db.db_parameter_group in .terraform/modules/db/modules/db_parameter_group\n- db.db_subnet_group in .terraform/modules/db/modules/db_subnet_group\n\nInitializing provider plugins...\n- Finding hashicorp/aws versions matching \"~\u003e 5.0, \u003e= 5.25.0\"...\n- Finding hashicorp/random versions matching \"\u003e= 3.1.0\"...\n- Installing hashicorp/aws v5.72.1...\n- Installed hashicorp/aws v5.72.1 (signed by HashiCorp)\n- Installing hashicorp/random v3.6.3...\n- Installed hashicorp/random v3.6.3 (signed by HashiCorp)\n\nTerraform has created a lock file .terraform.lock.hcl to record the provider\nselections it made above. Include this file in your version control repository\nso that Terraform can guarantee to make the same selections by default when\nyou run \"terraform init\" in the future.\n\nTerraform has been successfully initialized!\nExecuting terraform apply...\nmodule.db.module.db_instance.data.aws_partition.current: Reading...\nmodule.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=hum-rp-mysql-example-20241017205446204300000002]\nmodule.db.module.db_subnet_group.aws_db_subnet_group.this[0]: Refreshing state... [id=hum-rp-mysql-ex-node11-pr-2-modules-node-workload-externals-db-20241017205446203500000001]\nmodule.db.module.db_option_group.aws_db_option_group.this[0]: Refreshing state... [id=hum-rp-mysql-example-20241017205446204900000003]\nmodule.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]\nmodule.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...\nmodule.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]\nmodule.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=rds-basic-monitoring-role-20241017205446205500000004]\nmodule.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=rds-basic-monitoring-role-20241017205446205500000004-20241017205447182000000005]\n\nTerraform used the selected providers to generate the following execution\nplan. Resource actions are indicated with the following symbols:\n  + create\n\nTerraform will perform the following actions:\n\n  # module.db.module.db_instance.aws_db_instance.this[0] will be created\n  + resource \"aws_db_instance\" \"this\" {\n      + address                               = (known after apply)\n      + allocated_storage                     = 20\n      + allow_major_version_upgrade           = false\n      + apply_immediately                     = false\n      + arn                                   = (known after apply)\n      + auto_minor_version_upgrade            = true\n      + availability_zone                     = (known after apply)\n      + backup_retention_period               = 1\n      + backup_target                         = (known after apply)\n      + backup_window                         = (known after apply)\n      + ca_cert_identifier                    = (known after apply)\n      + character_set_name                    = (known after apply)\n      + copy_tags_to_snapshot                 = false\n      + db_name                               = \"my_database\"\n      + db_subnet_group_name                  = \"hum-rp-mysql-ex-node11-pr-2-modules-node-workload-externals-db-20241017205446203500000001\"\n      + dedicated_log_volume                  = false\n      + delete_automated_backups              = true\n      + deletion_protection                   = false\n      + domain_fqdn                           = (known after apply)\n      + endpoint                              = (known after apply)\n      + engine                                = \"mysql\"\n      + engine_lifecycle_support              = (known after apply)\n      + engine_version                        = \"8.0\"\n      + engine_version_actual                 = (known after apply)\n      + hosted_zone_id                        = (known after apply)\n      + iam_database_authentication_enabled   = false\n      + id                                    = (known after apply)\n      + identifier                            = \"hum-rp-mysql-example\"\n      + identifier_prefix                     = (known after apply)\n      + instance_class                        = \"db.t4g.large\"\n      + iops                                  = (known after apply)\n      + kms_key_id                            = (known after apply)\n      + latest_restorable_time                = (known after apply)\n      + license_model                         = (known after apply)\n      + listener_endpoint                     = (known after apply)\n      + maintenance_window                    = (known after apply)\n      + master_user_secret                    = (known after apply)\n      + master_user_secret_kms_key_id         = (known after apply)\n      + max_allocated_storage                 = 100\n      + monitoring_interval                   = 60\n      + monitoring_role_arn                   = \"arn:aws:iam::339712895890:role/rds-basic-monitoring-role-20241017205446205500000004\"\n      + multi_az                              = true\n      + nchar_character_set_name              = (known after apply)\n      + network_type                          = (known after apply)\n      + option_group_name                     = \"hum-rp-mysql-example-20241017205446204900000003\"\n      + parameter_group_name                  = \"hum-rp-mysql-example-20241017205446204300000002\"\n      + password                              = (sensitive value)\n      + performance_insights_enabled          = true\n      + performance_insights_kms_key_id       = (known after apply)\n      + performance_insights_retention_period = 7\n      + port                                  = 3306\n      + publicly_accessible                   = false\n      + replica_mode                          = (known after apply)\n      + replicas                              = (known after apply)\n      + resource_id                           = (known after apply)\n      + skip_final_snapshot                   = true\n      + snapshot_identifier                   = (known after apply)\n      + status                                = (known after apply)\n      + storage_encrypted                     = true\n      + storage_throughput                    = (known after apply)\n      + storage_type                          = (known after apply)\n      + tags_all                              = {\n          + \"hum:app\"    = \"node11\"\n          + \"hum:env\"    = \"pr-2\"\n          + \"hum:res\"    = \"modules.node-workload.externals.db\"\n          + \"humanitec\"  = \"true\"\n          + \"managed_by\" = \"terraform\"\n        }\n      + timezone                              = (known after apply)\n      + username                              = (sensitive value)\n      + vpc_security_group_ids                = [\n          + \"sg-0cb0afd368a823caf\",\n        ]\n\n      + timeouts {}\n    }\n\nPlan: 1 to add, 0 to change, 0 to destroy.\n\nChanges to Outputs:\n  + host     = (known after apply)\nmodule.db.module.db_instance.aws_db_instance.this[0]: Creating...\n\nError: creating RDS DB Instance (hum-rp-mysql-example): operation error RDS: CreateDBInstance, https response error StatusCode: 400, RequestID: bacad943-3231-4255-b0e4-bb5c38b2e280, DBInstanceAlreadyExists: DB instance already exists\n\n  with module.db.module.db_instance.aws_db_instance.this[0],\n  on .terraform/modules/db/modules/db_instance/main.tf line 29, in resource \"aws_db_instance\" \"this\":\n  29: resource \"aws_db_instance\" \"this\" {\n\n",
      "object_id": "",
      "scope": "environment",
      "summary": "Humanitec Operator error"
    }
  }
]

```

</details>

### [View in Humanitec](https://app.humanitec.io/orgs/htc-demo-41/apps/node11/envs/pr-2/deploys/17ff58d2450085ec)
Deployment ID: 17ff58d2450085ec

### Domains:

node-workload: [node11-pr-2.apps.cluster-qqhfp.qqhfp.sandbox620.opentlc.com](https://node11-pr-2.apps.cluster-qqhfp.qqhfp.sandbox620.opentlc.com)

<details><summary>Deployment diff</summary>

### Deployment diff:
```json

{
  "modules": {
    "add": null,
    "remove": [],
    "update": {
      "node-workload": [
        {
          "from": "",
          "op": "replace",
          "path": "/spec/containers/node-service/image",
          "value": "quay-qqhfp.apps.cluster-qqhfp.qqhfp.sandbox620.opentlc.com/quayadmin/node11:53c5db7"
        },
        {
          "from": "",
          "op": "replace",
          "path": "/spec/annotations/humanitec.io~1workload-source",
          "value": "https://github.com/luizfaorg/node11/blob/2/merge/score.yaml"
        }
      ]
    }
  },
  "shared": null
}

```

</details>
